<a href="https://colab.research.google.com/github/BenjaminSchell/Codes/blob/main/Day02_P2_notes.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [32]:
#selecting columns in dataframes
import pandas
import pandas as pd
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [4]:
#import the data:
#make sure the path on the line below corresponds to the path where you put your dataset.
titanic = pandas.read_csv("/content/drive/MyDrive/January_23/titanic.csv")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [5]:
# what is the data type of titanic?
type(titanic)

pandas.core.frame.DataFrame

In [9]:
# what are the features (column titles) of the titanic dataset?
titanic.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [10]:
# display only the 'embark_town' column of the titanic data
leaving = titanic.embark_town
leaving

0      Southampton
1        Cherbourg
2      Southampton
3      Southampton
4      Southampton
          ...
886    Southampton
887    Southampton
888    Southampton
889      Cherbourg
890     Queenstown
Name: embark_town, Length: 891, dtype: object

In [11]:
# what is the data type of the result of the previous cell?
type(leaving)

pandas.core.series.Series

In [13]:
# what is the "shape" of the data frame?
titanic.shape

(891, 15)

In [16]:
# make a subset (call the variable 'subset') of the data that consists of the last 20 rows of the data; verify that your subset has 20 rows
subset = titanic[871:]
print(subset.shape)
subset.head()

(20, 15)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
871,1,1,female,47.0,1,1,52.5542,S,First,woman,False,D,Southampton,yes,False
872,0,1,male,33.0,0,0,5.0000,S,First,man,True,B,Southampton,no,True
873,0,3,male,47.0,0,0,9.0000,S,Third,man,True,NaN,Southampton,no,True
874,1,2,female,28.0,1,0,24.0000,C,Second,woman,False,NaN,Cherbourg,yes,False
875,1,3,female,15.0,0,0,7.2250,C,Third,child,False,NaN,Cherbourg,yes,True

In [17]:
# use loc to print out the data for passenger 890 on the titanic dataframe
print(titanic.loc[890])
# use iloc to print out the data for passenger 890 on the subest dataframe
print(subset.iloc[19])

survived                0
pclass                  3
sex                  male
age                  32.0
sibsp                   0
parch                   0
fare                 7.75
embarked                Q
class               Third
who                   man
adult_male           True
deck                  NaN
embark_town    Queenstown
alive                  no
alone                True
Name: 890, dtype: object
survived                0
pclass                  3
sex                  male
age                  32.0
sibsp                   0
parch                   0
fare                 7.75
embarked                Q
class               Third
who                   man
adult_male           True
deck                  NaN
embark_town    Queenstown
alive                  no
alone                True
Name: 890, dtype: object

iloc:

loc:

In [19]:
# create a subset of the data (call the variable 'queenstown_subset') that consists only of passengers with a 'embark_town' that is "Queenstown"
# hint: if you get a warning, you may need to explicitly note that you are making a copy of the original data by using the .copy() function
queenstown_subset = titanic[ titanic['embark_town'] == 'Queenstown']
queenstown_subset.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
16,0,3,male,2.0,4,1,29.1250,Q,Third,child,False,NaN,Queenstown,no,False
22,1,3,female,15.0,0,0,8.0292,Q,Third,child,False,NaN,Queenstown,yes,True
28,1,3,female,NaN,0,0,7.8792,Q,Third,woman,False,NaN,Queenstown,yes,True
32,1,3,female,NaN,0,0,7.7500,Q,Third,woman,False,NaN,Queenstown,yes,True

In [20]:
# how many passengers are in queenstown_subset?
queenstown_subset.shape

(77, 15)

In [21]:
# what is the average fare for all of those in the queenstown_subset?
queenstown_subset.fare.mean()

13.276029870129872

In [29]:
# what is the average age for all of those in the queenstown_subset?
print(queenstown_subset.age.mean())
# do all of the passengers have an age recorded? What is recorded if there is no age?
queenstown_subset.age.isnull()

28.089285714285715

5       True
16     False
22     False
28      True
32      True
       ...
790     True
825     True
828     True
885    False
890    False
Name: age, Length: 77, dtype: bool

# What does unique(), mean(), isnull(), and fillna() do? Use a markdown cell to write your answers
# Use the Pandas documentation (https://pandas.pydata.org/pandas-docs/stable/reference/index.html)

In [25]:
# give examples of your use of unique(), mean(), median(), isnull()
print(titanic.sex.unique())
print(titanic.age.mean())
print(titanic.fare.median())
print(titanic.age.isnull())

['male' 'female']
29.69911764705882
14.4542
0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888     True
889    False
890    False
Name: age, Length: 891, dtype: bool

In [30]:
# in the queenstown_subet dataframe
# for each row that does not have an age recorded, replace the NaN value with the calculated average
# hint: don't use a loop; it can be done in 1 line of code using fillna()
queenstown_subset.age.fillna(queenstown_subset.age.mean())

5      28.089286
16      2.000000
22     15.000000
28     28.089286
32     28.089286
         ...
790    28.089286
825    28.089286
828    28.089286
885    39.000000
890    32.000000
Name: age, Length: 77, dtype: float64

In [34]:
# load in the iris data
iris_data = pd.read_csv('/content/drive/MyDrive/January_23/irisData.csv')
iris_data.head()
# what is the median sepal width of just the Setosas?
Setosa = iris_data[iris_data['species'] == 'Iris-setosa']
Setosa['sepal length'].median()

5.0

In [35]:
# for those iris that are classified as versicolor and have 
# a petal-length > 4, what is the average sepal width?
Versicolor = iris_data[(iris_data['species'] == 'Iris-versicolor') & (iris_data['petal length'] > 4)]
Versicolor['sepal width'].mean()

2.902941176470588